tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "ffmpeg"
brew "gh"
brew "git"
brew "jq"
brew "miller"
brew "node"
brew "openjdk"
brew "openapi-generator"
brew "openjdk@11"
brew "openjdk@17"
brew "python@3.8"
brew "ruby"
brew "terraform"
brew "tree"
brew "vim"
brew "youtube-dl"
cask "powershell"
